In [87]:
# Import dependencies

import pandas as pd
import numpy as np
import re

In [74]:
# Create file path

file = "employee_data.csv"

In [75]:
# Read file into pandas data frame and parse DOB as datetime object
employee = pd.read_csv(file, parse_dates=['DOB'], encoding='ISO-8859-1')

# Inspect first five rows
employee.head()

   Emp ID              Name        DOB          SSN         State
0     232      John Mathews 1991-02-24  289-31-9165  North Dakota
1     533      Nathan Moore 1978-11-19  220-05-7469         Maine
2     256    Amanda Douglas 1990-01-08  564-27-6961         Idaho
3     189   Heather Andrews 1976-08-11  742-79-1797       Vermont
4     284  Daniel Hernandez 1976-07-22  656-01-7473      Colorado

In [76]:
# Split employee name
name_split = employee['Name'].str.split(expand=True)

In [77]:
# Inspect split done on employee name
name_split.head()

         0          1
0     John    Mathews
1   Nathan      Moore
2   Amanda    Douglas
3  Heather    Andrews
4   Daniel  Hernandez

In [78]:
# Assign First Name to a variable
first_name = name_split[0]

In [79]:
# Assign Last Name to a variable
last_name = name_split[1]

In [80]:
# Convert DOB to m/d/Y format
dob = employee['DOB'].dt.strftime('%m/%d/%Y')

In [88]:
# Create the regex expression
regex = r'\d{3}\W\d{2}'

In [82]:
# Change SSN format to reflect the last four digits
employee['SSN'] = [re.sub(regex, '***-**', x) for x in employee['SSN']]

In [83]:
employee['SSN'].head()

0    ***-**-9165
1    ***-**-7469
2    ***-**-6961
3    ***-**-1797
4    ***-**-7473
Name: SSN, dtype: object

In [72]:
# Abbreviations of all 50 States. Source: https://gist.github.com/afhaque/29f0f4f37463c447770517a6c17d08f5
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [84]:
# Use abbreviated States name in State column
employee['State'] = employee['State'].map(us_state_abbrev)
employee.head()

   Emp ID              Name        DOB          SSN State
0     232      John Mathews 1991-02-24  ***-**-9165    ND
1     533      Nathan Moore 1978-11-19  ***-**-7469    ME
2     256    Amanda Douglas 1990-01-08  ***-**-6961    ID
3     189   Heather Andrews 1976-08-11  ***-**-1797    VT
4     284  Daniel Hernandez 1976-07-22  ***-**-7473    CO

In [85]:
# Inspect State column to verify mapping done correctly
employee['State'].unique()

array(['ND', 'ME', 'ID', 'VT', 'CO', 'MN', 'AR', 'CA', 'TN', 'OR', 'MD',
       'MA', 'KY', 'LA', 'RI', 'MT', 'PA', 'AL', 'VA', 'SD', 'UT', 'WY',
       'WI', 'NM', 'NC', 'SC', 'MI', 'CT', 'HI', 'KS', 'NY', 'MO', 'MS',
       'WA', 'TX', 'AK', 'FL', 'NE', 'DE', 'IL', 'OH', 'WV', 'NH', 'NJ',
       'IA', 'GA', 'NV', 'AZ', 'OK', 'IN'], dtype=object)

In [89]:
# Save analysis in a new csv
employee.to_csv('pyboss_solved.csv', index=False, header=True)